"""1. დაწერეთ პითონის კოდი, რომელიც იღებს სტრიქონს და აბრუნებს სტრიქონის UTF-8 დაშიფრულ ვერსიას."""

text1 = "გამარჯობა!"
print(text1.encode())


"""2. დაწერეთ პითონის კოდი, რომელიც იღებს სტრიქონს. ჩამოაშორეთ ზედმეტი ინტერვალები. ყველა სიმბოლო გადაიყვანეთ პატარა 
ასოებში და დაუმატეთ ქვესტრიქონი 'Python'. თუ შეყვანილ სტრიქონში არსებობს სიტყვა "python", ჩაანაცვლეთ "Python"-ით.
მინიშნება: ზედმეტი ინტერვალების ჩამოსაშორებელი მეთოდია `.strip()`. მაგ.:"  Python is funny     ".strip()   ====>  "Python is funny" """

text2 = "  python Lesson    Is     Funny.        "
text2 = ' '.join(text2.split()).lower() + " Python"
print(text2.replace('python','Python'))


"""3. დაწერეთ პითონის კოდი, რომელიც იღებს სტრიქონს და აბრუნებს ახალ სტრიქონს, რომელიც შედგება შეყვანილი 
სტრიქონის პირველი ნახევრისაგან. """

text3 = "Hello World! Python Is Funny."
print(text3[:(len(text3)-1)//2])


"""4. დაწერეთ პითონის კოდი, რომელიც იღებს სტრიქონს. string მოდულის გამოყენებით დაწერეთ შემოწმება. სტრიქონი ვალიდურია 
მაშინ, როდესაც ის შეიცავს ერთ ციფრს და არ არის დამატებითი სიმბოლოები ('!', '~', '#', '$' და ა.შ.) """

text4 = "asdsd3lskhfsjdflsk"

if sum(i.isdigit() for i in text4) == 1 and text4.isalnum() == True:
    print(True)
else:
    print(False)


"""5. დაწერეთ პითონის კოდი, რომელიც იღებს სტრიქონს, სტრიქონი გადაყავს ბაიტებში, ბეჭდავს მნიშვნელობას და შემდეგ კი 
გადაყავს ბაიტებიდან სტრიქონში და ბეჭდავს სტრიქონს."""

text5 = "ზურაბ ქობალია"
text5 = text5.encode()

print(text5)
print(text5.decode())